# Introdução ao Pandas (Parte 2)

## Imports

In [ ]:
import pandas as pd

## Acessando os Dados

Através de operações de `dict` e `list`

In [ ]:
nome_cidade = pd.Series(['Campina Grande', 'Patos', 'Sousa'])
populacao = pd.Series([399999, 1499999, 99777])

df_city = pd.DataFrame({ 'Nome da Cidade': nome_cidade, 'População': populacao })
df_city

   Nome da Cidade  População
0  Campina Grande     399999
1           Patos    1499999
2           Sousa      99777

In [ ]:
type(df_city['Nome da Cidade'])

pandas.core.series.Series

In [ ]:
df_city['Nome da Cidade']

0    Campina Grande
1             Patos
2             Sousa
Name: Nome da Cidade, dtype: object

In [ ]:
type(df_city['Nome da Cidade'][1])

str

In [ ]:
df_city['Nome da Cidade'][1]

'Patos'

In [ ]:
df_city[1]['Nome da Cidade'] # erro !

KeyError: ignored

In [ ]:
type(df_city[0:2])

pandas.core.frame.DataFrame

In [ ]:
df_city[0:2] # filtra as linhas, mantendo todas as colunas

   Nome da Cidade  População
0  Campina Grande     399999
1           Patos    1499999

In [ ]:
df_city[0:2][:] # filtra as linhas, mantendo todas as colunas

   Nome da Cidade  População
0  Campina Grande     399999
1           Patos    1499999

In [ ]:
df_city[:]['Nome da Cidade'] # filtra as colunas, mantendo todas as linhas

0    Campina Grande
1             Patos
2             Sousa
Name: Nome da Cidade, dtype: object

In [ ]:
df_city['Nome da Cidade'][:] # filtra as colunas, mantendo todas as linhas

0    Campina Grande
1             Patos
2             Sousa
Name: Nome da Cidade, dtype: object

In [ ]:
df_city[['Nome da Cidade', 'População']][0:2] # filtra as colunas, filtra as linhas

   Nome da Cidade  População
0  Campina Grande     399999
1           Patos    1499999

#### **ATIVIDADE 6:** a função `value_counts()` só tem o parâmetro `bins` em `Series`, não tem em `DataFrame`. Escreva abaixo um código que processa o `DataFrame` `df_toy`, extraindo uma `Series` que corresponde a uma coluna com valores contínuos (apenas os 1000 primeiros elementos da Serie) e aplique `value_counts()` com o parâmetro `bins` igual a 5 para ver o efeito.

Mais informações sobre a função `value_counts()` em `Series` podem ser encontradas [aqui](https://pandas.pydata.org/docs/reference/api/pandas.Series.value_counts.html#pandas.Series.value_counts).

In [ ]:
# Caso precise realizar novamente o download e recarregar o dataframe toy_df, basta executar o código abaixo

!wget -O toy_dataset.csv "https://docs.google.com/uc?export=download&id=1ArGT0_cisUUh3QXW9tYM39azFQZDUnow"
df_toy = pd.read_csv('toy_dataset.csv')
df_toy

--2021-12-11 16:40:17--  https://docs.google.com/uc?export=download&id=1ArGT0_cisUUh3QXW9tYM39azFQZDUnow
Resolving docs.google.com (docs.google.com)... 142.250.141.138, 142.250.141.101, 142.250.141.100, ...
Connecting to docs.google.com (docs.google.com)|142.250.141.138|:443... connected.
HTTP request sent, awaiting response... 302 Moved Temporarily
Location: https://doc-08-6g-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/hgf3u1989efe36c9d2kuipaidobp8d43/1639240800000/12301012272938841923/*/1ArGT0_cisUUh3QXW9tYM39azFQZDUnow?e=download [following]
Warning: wildcards not supported in HTTP.
--2021-12-11 16:40:17--  https://doc-08-6g-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/hgf3u1989efe36c9d2kuipaidobp8d43/1639240800000/12301012272938841923/*/1ArGT0_cisUUh3QXW9tYM39azFQZDUnow?e=download
Resolving doc-08-6g-docs.googleusercontent.com (doc-08-6g-docs.googleusercontent.com)... 142.250.141.132, 2607:f8b0:4023:c0b::84
Connecting to doc-08-6g-docs.googleusercontent.com (doc-08-6g-docs.googleusercontent.com)|142.250.141.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 5735570 (5.5M) [text/csv]
Saving to: ‘toy_dataset.csv’

toy_dataset.csv     100%[===================>]   5.47M  22.5MB/s    in 0.2s

2021-12-11 16:40:18 (22.5 MB/s) - ‘toy_dataset.csv’ saved [5735570/5735570]

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [ ]:
# seu código aqui (solução da atividade)

df_toy[0:100]['Age']

0     41
1     54
2     42
3     40
4     46
      ..
95    48
96    30
97    44
98    62
99    48
Name: Age, Length: 100, dtype: int64

In [ ]:
df_toy[0:100]['Age'].value_counts(bins=5)

(40.6, 48.4]                  34
(56.2, 64.0]                  20
(32.8, 40.6]                  16
(24.959999999999997, 32.8]    16
(48.4, 56.2]                  14
Name: Age, dtype: int64

#### **ATIVIDADE 7:** Caso seus bins da questão anterior estejam dedordenados, escreva um código modificado que exibe-os ordenados, para facilitar a análise.

Saída esperada:

```
(16115.5, 26667.8]     6
(26667.8, 37167.6]    21
(37167.6, 47667.4]    27
(47667.4, 58167.2]    36
(58167.2, 68667.0]    10
Name: Income, dtype: int64
```

Dica: busque na [documentação de Pandas Series](https://pandas.pydata.org/docs/reference/series.html) uma função que realiza a ordenação:

In [ ]:
# seu código aqui

df_toy[0:100]['Income'].value_counts(bins=5).sort_index()

(16115.5, 26667.8]     6
(26667.8, 37167.6]    21
(37167.6, 47667.4]    27
(47667.4, 58167.2]    36
(58167.2, 68667.0]    10
Name: Income, dtype: int64

## Acessando com loc e iloc

Vamos criar um novo `data_frame`

In [ ]:
data_clima = [
              [25, 76.2, 1.0, 'Chuvoso'],
              [27, 76.2, 0.1, 'Chuvoso'],
              [28, 44.2, 1.1, 'Ensolarado'],
              [27, 56.2, 0.25, 'Nublado'],
              [23, 77.2, 1.1, 'Chuvoso']
            ]

df_clima = pd.DataFrame(data_clima,
                       columns=['Temperatura','Umidade','Precipitacao', 'Tempo'],
                       index=['Segunda-feira','Terça-feira','Quarta-feira', 'Quinta-feira', 'Sexta-feira']
                       )
df_clima

               Temperatura  Umidade  Precipitacao       Tempo
Segunda-feira           25     76.2          1.00     Chuvoso
Terça-feira             27     76.2          0.10     Chuvoso
Quarta-feira            28     44.2          1.10  Ensolarado
Quinta-feira            27     56.2          0.25     Nublado
Sexta-feira             23     77.2          1.10     Chuvoso

In [ ]:
df_clima.loc['Segunda-feira']

Temperatura          25
Umidade            76.2
Precipitacao          1
Tempo           Chuvoso
Name: Segunda-feira, dtype: object

In [ ]:
type(df_clima.loc['Segunda-feira'])

pandas.core.series.Series

In [ ]:
df_clima.loc[0] #erro

KeyError: ignored

In [ ]:
df_clima.iloc[0] #OK

Temperatura          25
Umidade            76.2
Precipitacao          1
Tempo           Chuvoso
Name: Segunda-feira, dtype: object

In [ ]:
type(df_clima.iloc[0])

pandas.core.series.Series

In [ ]:
df_toy.loc[0] #erro ou OK?

Number          1
City       Dallas
Gender       Male
Age            41
Income      40367
Illness        No
Name: 0, dtype: object

In [ ]:
df_clima.loc[['Quinta-feira'], ['Umidade']]

              Umidade
Quinta-feira     56.2

In [ ]:
df_clima.iloc[3, 1]

56.2

In [ ]:
df_clima.loc[['Segunda-feira','Terça-feira','Quinta-feira']] # seleciona determinadas linhas

               Temperatura  Umidade  Precipitacao    Tempo
Segunda-feira           25     76.2          1.00  Chuvoso
Terça-feira             27     76.2          0.10  Chuvoso
Quinta-feira            27     56.2          0.25  Nublado

In [ ]:
df_clima.iloc[[0,1,3]] # seleciona determinadas linhas

               Temperatura  Umidade  Precipitacao    Tempo
Segunda-feira           25     76.2          1.00  Chuvoso
Terça-feira             27     76.2          0.10  Chuvoso
Quinta-feira            27     56.2          0.25  Nublado

In [ ]:
df_clima.loc[['Segunda-feira','Terça-feira','Quinta-feira'],['Temperatura', 'Tempo']] # algumas linhas e algumas colunas

               Temperatura    Tempo
Segunda-feira           25  Chuvoso
Terça-feira             27  Chuvoso
Quinta-feira            27  Nublado

In [ ]:
df_clima.iloc[[0,1,3],[0,3]] # algumas linhas e algumas colunas

               Temperatura    Tempo
Segunda-feira           25  Chuvoso
Terça-feira             27  Chuvoso
Quinta-feira            27  Nublado

In [ ]:
df_clima.iloc[:, 0] #todas as linhas de uma coluna

Segunda-feira    25
Terça-feira      27
Quarta-feira     28
Quinta-feira     27
Sexta-feira      23
Name: Temperatura, dtype: int64

In [ ]:
df_clima.loc[:, ['Temperatura', 'Tempo']] #todas as linhas de determinadas colunas

               Temperatura       Tempo
Segunda-feira           25     Chuvoso
Terça-feira             27     Chuvoso
Quarta-feira            28  Ensolarado
Quinta-feira            27     Nublado
Sexta-feira             23     Chuvoso

In [ ]:
df_clima.iloc[:, [0,2]] #todas as linhas de determinadas colunas

               Temperatura  Precipitacao
Segunda-feira           25          1.00
Terça-feira             27          0.10
Quarta-feira            28          1.10
Quinta-feira            27          0.25
Sexta-feira             23          1.10

#### **ATIVIDADE 8:** 

(a) escreva um código para recuperar um df contendo as linhas segunda-feira e quarta-feira, com todas as colunas, utilizando `iloc`.

(b) escreva um código equivalente usando `loc`.

In [ ]:
# (a) seu código aqui

df_clima.iloc[[0,2]]

               Temperatura  Umidade  Precipitacao       Tempo
Segunda-feira           25     76.2           1.0     Chuvoso
Quarta-feira            28     44.2           1.1  Ensolarado

In [ ]:
# (b) seu código aqui

df_clima.loc[['Segunda-feira','Quarta-feira']]

               Temperatura  Umidade  Precipitacao       Tempo
Segunda-feira           25     76.2           1.0     Chuvoso
Quarta-feira            28     44.2           1.1  Ensolarado

## Acessando com slice

Formato start:stop:step

In [ ]:
# sem step
linhas=[0,4]
df_clima.iloc[linhas, 1:3]

               Umidade  Precipitacao
Segunda-feira     76.2           1.0
Sexta-feira       77.2           1.1

In [ ]:
# com step nas linhas
df_clima.iloc[0:5:2, 0:3]

               Temperatura  Umidade  Precipitacao
Segunda-feira           25     76.2           1.0
Quarta-feira            28     44.2           1.1
Sexta-feira             23     77.2           1.1

In [ ]:
# Usando labels (com .loc[])
df_clima.loc['Segunda-feira':'Sexta-feira':2, 'Temperatura':'Umidade']

               Temperatura  Umidade
Segunda-feira           25     76.2
Quarta-feira            28     44.2
Sexta-feira             23     77.2

## Seleção com expressões booleanas

In [ ]:
st = df_clima['Temperatura']
st

Segunda-feira    25
Terça-feira      27
Quarta-feira     28
Quinta-feira     27
Sexta-feira      23
Name: Temperatura, dtype: int64

In [ ]:
st[st>26]

Terça-feira     27
Quarta-feira    28
Quinta-feira    27
Name: Temperatura, dtype: int64

In [ ]:
df_clima2 = df_clima[['Temperatura', 'Umidade', 'Precipitacao']]
df_clima2

               Temperatura  Umidade  Precipitacao
Segunda-feira           25     76.2          1.00
Terça-feira             27     76.2          0.10
Quarta-feira            28     44.2          1.10
Quinta-feira            27     56.2          0.25
Sexta-feira             23     77.2          1.10

In [ ]:
df_clima2[df_clima2 > 1]

               Temperatura  Umidade  Precipitacao
Segunda-feira           25     76.2           NaN
Terça-feira             27     76.2           NaN
Quarta-feira            28     44.2           1.1
Quinta-feira            27     56.2           NaN
Sexta-feira             23     77.2           1.1

In [ ]:
df_clima2[df_clima2['Temperatura'] > 26]

              Temperatura  Umidade  Precipitacao
Terça-feira            27     76.2          0.10
Quarta-feira           28     44.2          1.10
Quinta-feira           27     56.2          0.25

In [ ]:
df_clima2[(df_clima2['Temperatura'] > 26) & (df_clima2['Precipitacao'] < 1)] # erro se não usar parênteses

              Temperatura  Umidade  Precipitacao
Terça-feira            27     76.2          0.10
Quinta-feira           27     56.2          0.25

In [ ]:
df_clima2.query('Temperatura > 26 & Precipitacao < 1')

              Temperatura  Umidade  Precipitacao
Terça-feira            27     76.2          0.10
Quinta-feira           27     56.2          0.25

In [ ]:
df_clima[df_clima['Tempo'] == 'Nublado']['Temperatura']

Quinta-feira    27
Name: Temperatura, dtype: int64

In [ ]:
df_clima['Temperatura'][df_clima['Tempo'] == 'Nublado']

Quinta-feira    27
Name: Temperatura, dtype: int64

In [ ]:
df_clima[df_clima['Tempo'].str.startswith('C')]

               Temperatura  Umidade  Precipitacao    Tempo
Segunda-feira           25     76.2           1.0  Chuvoso
Terça-feira             27     76.2           0.1  Chuvoso
Sexta-feira             23     77.2           1.1  Chuvoso

In [ ]:
df_clima[df_clima['Tempo'].isin(['Chuvoso', 'Ensolarado'])]

               Temperatura  Umidade  Precipitacao       Tempo
Segunda-feira           25     76.2           1.0     Chuvoso
Terça-feira             27     76.2           0.1     Chuvoso
Quarta-feira            28     44.2           1.1  Ensolarado
Sexta-feira             23     77.2           1.1     Chuvoso

#### **ATIVIDADE 9:**

Faça filtragem no `df_clima` de forma a retornar a Umidade de todos os registros cuja Temperatura seja 23, 27 ou 28; e o Tempo comece com 'C'.

In [ ]:
# seu código aqui
df_clima['Umidade'][((df_clima['Temperatura'] == 23) | (df_clima['Temperatura'] == 27) | (df_clima['Temperatura'] == 28) ) & (df_clima['Tempo'].str.startswith('C'))]

Terça-feira    76.2
Sexta-feira    77.2
Name: Umidade, dtype: float64

## Manipulação de Linhas e Colunas (Adição, Remoção, etc)

In [ ]:
# criando o data frame

d = {'primeira coluna' : pd.Series([11, 22, 32], index=['a', 'b', 'c']),
   'segunda coluna' : pd.Series([11, 22, 33, 44], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

In [ ]:
# adicionando nova coluna
df['terceira coluna']=pd.Series([100,200,300],index=['a','b','c'])
df

   primeira coluna  segunda coluna  terceira coluna
a             11.0              11            100.0
b             22.0              22            200.0
c             32.0              33            300.0
d              NaN              44              NaN

In [ ]:
# criando coluna a partir de outras existentes

df['quarta coluna'] = df['primeira coluna'] + df['terceira coluna']
df

   primeira coluna  segunda coluna  terceira coluna  quarta coluna
a             11.0              11            100.0          111.0
b             22.0              22            200.0          222.0
c             32.0              33            300.0          332.0
d              NaN              44              NaN            NaN

In [ ]:
# removendo uma coluna

df.pop('quarta coluna')
df

   primeira coluna  segunda coluna  terceira coluna
a             11.0              11            100.0
b             22.0              22            200.0
c             32.0              33            300.0
d              NaN              44              NaN

In [ ]:
df.drop('a')

   primeira coluna  segunda coluna  terceira coluna
b             22.0              22            200.0
c             32.0              33            300.0
d              NaN              44              NaN

In [ ]:
df # o que aconteceu ?

   primeira coluna  segunda coluna  terceira coluna
a             11.0              11            100.0
b             22.0              22            200.0
c             32.0              33            300.0
d              NaN              44              NaN

In [ ]:
# drop também pode ser usado para colunas
df = df.drop('segunda coluna', axis=1)
df

   primeira coluna  terceira coluna
a             11.0            100.0
b             22.0            200.0
c             32.0            300.0
d              NaN              NaN

In [ ]:
df2 = pd.DataFrame([[50, 60], [70, 80]], columns = ['primeira coluna','terceira coluna'])
df = df.append(df2)
df

   primeira coluna  terceira coluna
a             11.0            100.0
b             22.0            200.0
c             32.0            300.0
d              NaN              NaN
0             50.0             60.0
1             70.0             80.0

In [ ]:
df2 = pd.DataFrame([[90, 99], [66, 88]], columns = ['primeira coluna','segunda coluna'])
df = df.append(df2)
df

   primeira coluna  terceira coluna  segunda coluna
a             11.0            100.0             NaN
b             22.0            200.0             NaN
c             32.0            300.0             NaN
d              NaN              NaN             NaN
0             50.0             60.0             NaN
1             70.0             80.0             NaN
0             90.0              NaN            99.0
1             66.0              NaN            88.0

####**ATIVIDADE 10:**

O dataframe da célula anterior ficou com as colunas bagunçadas (primeira/terceira/segunda). 

a) Reorganize as colunas.

b) O índice das linhas também ficaram bagunçados! Reorganize-os também para ficar com numeração 0,1,2,...,n. Dica: use o método reset_index(). Depois de usar o método, veja se o dataframe ficou da forma que você esperava. Se não tiver ficado, ajuste-o.

In [ ]:
# a) seu código aqui

df = df[['primeira coluna','segunda coluna', 'terceira coluna']]
df

   primeira coluna  segunda coluna  terceira coluna
a             11.0             NaN            100.0
b             22.0             NaN            200.0
c             32.0             NaN            300.0
d              NaN             NaN              NaN
0             50.0             NaN             60.0
1             70.0             NaN             80.0
0             90.0            99.0              NaN
1             66.0            88.0              NaN

In [ ]:
# b) seu código aqui

df = df.reset_index().drop('index', axis=1)
df

   primeira coluna  segunda coluna  terceira coluna
0             11.0             NaN            100.0
1             22.0             NaN            200.0
2             32.0             NaN            300.0
3              NaN             NaN              NaN
4             50.0             NaN             60.0
5             70.0             NaN             80.0
6             90.0            99.0              NaN
7             66.0            88.0              NaN

Isso é só um pouquinho do que o Pandas oferece no que se trata de indexação e seleção. A API do pandas é muito vasta em relação a isso. 
Para mais informações, [veja aqui](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html).